{
    "en": {
      "welcome": "Welcome! Please select your language:",
      "subscribe": "To use the bot, please subscribe to our channel:",
      "check": "✅ Check subscription",
      "subscribe_btn": "📢 Subscribe to channel",
      "access_granted": "🎉 Access granted! Loading menu...",
      "not_subscribed": "❌ You are not subscribed! Click 'Subscribe' and try again.",
      "check_error": "⚠️ Subscription check error. Please try later.",
      "menu": "Main Menu",
      "reg": "📝 Registration",
      "instr": "📚 Instructions",
      "support": "🛠 Support",
      "algo": "⚙️ Algorithm",
      "next": "➡️ Next",
      "back": "⬅️ Back",
      "registration_message": "👑 Hello!To activate the bot, take a quick registration on the 1win website (<a href = \"personal_link\"> click </a>)\n\n⚠️ It is important to create a new account by the link in this message!According to the phone number that was previously unused on this site, as well as without the use of social networks.If you already have an account on 1win, <a href = \"personal_link\"> go </a>.\n\n1. Press the button: <a href = \"personal_Link\"> register </a> (turning on the incognito mode), go to the 1win website and create a new account.If the site does not open, try using VPN: VPNIFY, PLANET VPN, HOTSPOT VPN and so on!\n\n2. Be sure to enter the Botavia promo code when registering.\n\n3. Fill the balance of your account.I recommend replenishing balance from 2000 rubles.\n\n4. Go to section 1win Games and select the game.\n\n5. Then click \"Get a signal.\"",
      "dep": "👑Before starting, you need to top up your account balance. I recommend topping up with at least 2,000 rubles.",
      "support_text": "If you have any questions — contact support:\n👉 @maboy_poderzhka — we’ll help you quickly and clearly.",
      "instructions": "📘 How to Use AI TRADING\n\nThis bot is designed to help you get fast and accurate signals for trading on Pocket Option.\nBelow you'll find a step-by-step guide on how to set things up correctly and use the bot's features."
    },
    "ru": {
      "welcome": "Добро пожаловать! Пожалуйста, выберите язык:",
      "subscribe": "Для использования бота необходимо подписаться на наш канал:",
      "check": "✅ Проверить подписку",
      "subscribe_btn": "📢 Подписаться на канал",
      "access_granted": "🎉 Доступ разрешен! Загружаем меню...",
      "not_subscribed": "❌ Вы не подписаны! Нажмите 'Подписаться' и попробуйте снова.",
      "check_error": "⚠️ Ошибка проверки подписки. Попробуйте позже.",
      "menu": "👋 Привет! Я — AI TRADING 🤖📈\n\nЯ создан на базе искусственного интеллекта, чтобы давать точные сигналы для торговли на Pocket Option.\n\nМои алгоритмы анализируют рынок в реальном времени и помогают находить лучшие точки входа.",
      "reg": "📝 Регистрация",
      "instr": "📚 Инструкция",
      "support": "🛠 Поддержка",
      "algo": "⚙️ Алгоритм",
      "next": "Подтвердить ID",
      "back": "⬅️ Назад",
      "registration_message": "👑 Привет! Для активации бота пройди быструю регистрацию на сайте Pocket Option (<a href=\"PERSONAL_LINK\">КЛИК</a>)\n\n⚠️ Важно создать НОВЫЙ аккаунт по ссылке в этом сообщении! Если у вас уже есть аккаунт на Pocket Option, <a href=\"PERSONAL_LINK\">выйдите</a>.\n\n1. Нажмите на кнопку: <a href=\"PERSONAL_LINK\">Зарегистрироваться</a> (включив режим инкогнито), перейдите на сайт Pocket Option и СОЗДАЙТЕ НОВЫЙ АККАУНТ. Если сайт не открывается, попробуйте использовать VPN: Vpnify, Planet VPN, Hotspot VPN и так далее!\n\n 2. Внесите депозит. \n\n 3. Затем нажмите «Получить сигнал».",
      "dep": "👑Перед стартом необходимо пополнить баланс своего аккаунта. Рекомендую пополнять от 2000 рублей.",
      "support_text": "Если у тебя возникли вопросы — напиши в поддержку:\n👉 @maboy_poderzhka — поможем быстро и по делу.",
      "instructions": "📘 Инструкция по использованию AI TRADING\n\nЭтот бот создан, чтобы помочь тебе получать быстрые и точные сигналы для торговли на Pocket Option.\nНиже ты найдёшь пошаговую инструкцию, как правильно настроить работу и использовать возможности бота."
    },
    "hi": {
      "welcome": "स्वागत है! कृपया अपनी भाषा चुनें:",
      "subscribe": "बॉट का उपयोग करने के लिए, कृपया हमारे चैनल को सब्सक्राइब करें:",
      "check": "✅ सदस्यता जांचें",
      "subscribe_btn": "📢 चैनल को सब्सक्राइब करें",
      "access_granted": "🎉 पहुंच प्रदान की गई! मेनू लोड हो रहा है...",
      "not_subscribed": "❌ आपने सब्सक्राइब नहीं किया है! 'सब्सक्राइब करें' पर क्लिक करें और फिर से प्रयास करें।",
      "check_error": "⚠️ सदस्यता जांच त्रुटि। कृपया बाद में प्रयास करें।",
      "menu": "मुख्य मेनू",
      "reg": "📝 पंजीकरण",
      "instr": "📚 निर्देश",
      "support": "🛠 समर्थन",
      "algo": "⚙️ एल्गोरिदम",
      "next": "➡️ अगला",
      "back": "⬅️ पीछे",
      "registration_message": "👑 नमस्ते!बॉट को सक्रिय करने के लिए, 1win वेबसाइट पर एक त्वरित पंजीकरण लें (<a href = \"Personal_link\"> क्लिक करें </a>)\n\n⚠ इस संदेश में लिंक द्वारा एक नया खाता बनाना महत्वपूर्ण है!फोन नंबर के अनुसार जो पहले इस साइट पर अप्रयुक्त था, साथ ही साथ सोशल नेटवर्क के उपयोग के बिना भी।यदि आपके पास पहले से ही 1win पर खाता है, <a href = \"Personal_link\"> go </a>।\n\n1। बटन दबाएं: <a href = \"Personal_link\"> रजिस्टर </a> (incognito मोड को चालू करना), 1win वेबसाइट पर जाएं और एक नया खाता बनाएं।यदि साइट नहीं खुली है, तो VPN का उपयोग करने का प्रयास करें: VPNIFY, PLANET VPN, HOTSPOT VPN और इसी तरह!\n\n2। पंजीकरण करते समय बोटविया प्रोमो कोड दर्ज करना सुनिश्चित करें।\n\n3। अपने खाते का संतुलन भरें।मैं 2000 रूबल से संतुलन को फिर से भरने की सलाह देता हूं।\n\n4। धारा 1win खेलों पर जाएं और खेल का चयन करें।\n\n5। फिर \"एक संकेत प्राप्त करें\" पर क्लिक करें।",
      "dep": "👑आरंभ करने से पहले आपको अपने खाते का बैलेंस भरना होगा। मैं कम से कम 2000 रूबल भरने की सलाह देता हूँ।",
      "support_text": "यदि आपके कोई प्रश्न हैं — सहायता से संपर्क करें:\n👉 @maboy_poderzhka — हम तेज़ी और स्पष्ट रूप से मदद करेंगे।",
      "instructions": "📘 AI TRADING का उपयोग कैसे करें\n\nयह बॉट Pocket Option पर ट्रेडिंग के लिए तेज़ और सटीक सिग्नल पाने में आपकी मदद करने के लिए बनाया गया है।\nनीचे आप चरण-दर-चरण निर्देश पाएंगे कि सेटअप सही तरीके से कैसे करें और बॉट की सुविधाओं का उपयोग कैसे करें।"
    },
    "id": {
      "welcome": "Selamat datang! Silakan pilih bahasa Anda:",
      "subscribe": "Untuk menggunakan bot, silakan berlangganan channel kami:",
      "check": "✅ Periksa langganan",
      "subscribe_btn": "📢 Berlangganan channel",
      "access_granted": "🎉 Akses diberikan! Memuat menu...",
      "not_subscribed": "❌ Anda belum berlangganan! Klik 'Berlangganan' dan coba lagi.",
      "check_error": "⚠️ Kesalahan pemeriksaan langganan. Silakan coba lagi nanti.",
      "menu": "Menu Utama",
      "reg": "📝 Pendaftaran",
      "instr": "📚 Petunjuk",
      "support": "🛠 Dukungan",
      "algo": "⚙️ Algoritma",
      "next": "➡️ Lanjut",
      "back": "⬅️ Kembali",
      "registration_message": "👑 Halo!Untuk mengaktifkan bot, ambil pendaftaran cepat di situs web 1Win (<a href = \"pribadi_link\"> klik </a>)\n\n⚠️ Penting untuk membuat akun baru dengan tautan dalam pesan ini!Menurut nomor telepon yang sebelumnya tidak digunakan di situs ini, serta tanpa menggunakan jejaring sosial.Jika Anda sudah memiliki akun di 1win, <a href = \"pribadi_link\"> go </a>.\n\n1. Tekan tombol: <a href = \"pribadi_link\"> Daftar </a> (menyalakan mode penyamaran), buka situs web 1Win dan buat akun baru.Jika situs tidak terbuka, coba gunakan VPN: VPNIFY, Planet VPN, Hotspot VPN dan sebagainya!\n\n2. Pastikan untuk memasukkan kode promo BOTAVIA saat mendaftar.\n\n3. Isi saldo akun Anda.Saya merekomendasikan pengisian ulang keseimbangan dari 2000 rubel.\n\n4. Pergi ke bagian 1Win game dan pilih game.\n\n5. Kemudian klik \"Dapatkan Sinyal.\"",
      "dep": "👑Sebelum memulai, Anda perlu mengisi saldo akun Anda. Saya menyarankan untuk mengisi minimal 2.000 rubel.",
      "support_text": "Jika Anda memiliki pertanyaan — hubungi dukungan:\n👉 @maboy_poderzhka — kami akan membantu dengan cepat dan jelas.",
      "instructions": "📘 Panduan Penggunaan AI TRADING\n\nBot ini dibuat untuk membantu kamu mendapatkan sinyal cepat dan akurat untuk trading di Pocket Option.\nDi bawah ini kamu akan menemukan panduan langkah demi langkah tentang cara menyiapkan dengan benar dan menggunakan fitur bot."
    },
    "pt": {
      "welcome": "Bem-vindo! Por favor selecione seu idioma:",
      "subscribe": "Para usar o bot, por favor assine nosso canal:",
      "check": "✅ Verificar assinatura",
      "subscribe_btn": "📢 Assinar canal",
      "access_granted": "🎉 Acesso concedido! Carregando menu...",
      "not_subscribed": "❌ Você não está inscrito! Clique em 'Assinar' e tente novamente.",
      "check_error": "⚠️ Erro na verificação de assinatura. Por favor tente mais tarde.",
      "menu": "Menu Principal",
      "reg": "📝 Registro",
      "instr": "📚 Instruções",
      "support": "🛠 Suporte",
      "algo": "⚙️ Algoritmo",
      "next": "➡️ Próximo",
      "back": "⬅️ Voltar",
      "registration_message": "👑 Olá!Para ativar o bot, faça um registro rápido no site 1Win (<a href = \"personal_link\"> clique </a>)\n\n⚠️ É importante criar uma nova conta pelo link nesta mensagem!De acordo com o número de telefone que anteriormente não era utilizado neste site, bem como sem o uso de redes sociais.Se você já possui uma conta no 1Win, <a href = \"personal_link\"> go </a>.\n\n1. Pressione o botão: <a href = \"personal_link\"> registrar </a> (ativar o modo incógnito), vá para o site 1Win e crie uma nova conta.Se o site não abrir, tente usar VPN: vpnify, Planet VPN, Hotspot VPN e assim por diante!\n\n2. Certifique -se de inserir o código promocional da Botávia ao se registrar.\n\n3. Preencha o saldo da sua conta.Eu recomendo reabastecer o saldo de 2000 rublos.\n\n4. Vá para os jogos da Seção 1win e selecione o jogo.\n\n5. Em seguida, clique em \"Obtenha um sinal\".",
      "dep": "👑Antes de começar, você precisa recarregar o saldo da sua conta. Recomendo recarregar com pelo menos 2.000 rublos.",
      "support_text": "Se você tiver alguma dúvida — fale com o suporte:\n👉 @maboy_poderzhka — ajudamos de forma rápida e objetiva.",
      "instructions": "📘 Como usar o AI TRADING\n\nEste bot foi criado para ajudar você a obter sinais rápidos e precisos para operar na Pocket Option.\nAbaixo você encontrará um guia passo a passo de como configurar tudo corretamente e usar os recursos do bot."
    },
    "vi": {
      "welcome": "Chào mừng! Vui lòng chọn ngôn ngữ của bạn:",
      "subscribe": "Để sử dụng bot, vui lòng đăng ký kênh của chúng tôi:",
      "check": "✅ Kiểm tra đăng ký",
      "subscribe_btn": "📢 Đăng ký kênh",
      "access_granted": "🎉 Đã cấp quyền truy cập! Đang tải menu...",
      "not_subscribed": "❌ Bạn chưa đăng ký! Nhấn 'Đăng ký' và thử lại.",
      "check_error": "⚠️ Lỗi kiểm tra đăng ký. Vui lòng thử lại sau.",
      "menu": "Menu Chính",
      "reg": "📝 Đăng ký",
      "instr": "📚 Hướng dẫn",
      "support": "🛠 Hỗ trợ",
      "algo": "⚙️ Thuật toán",
      "next": "➡️ Tiếp",
      "back": "⬅️ Quay lại",
      "registration_message": "👑 Xin chào!Để kích hoạt bot, hãy đăng ký nhanh trên trang web 1Win (<a href = \"cá nhân_link\"> Nhấp vào </a>)\n\nĐiều quan trọng là tạo một tài khoản mới bằng liên kết trong thông báo này!Theo số điện thoại trước đây không được sử dụng trên trang web này, cũng như không sử dụng mạng xã hội.Nếu bạn đã có một tài khoản trên 1Win, <a href = \"cá nhân_link\"> đi </a>.\n\n1. Nhấn nút: <a href = \"cá nhân_link\"> Đăng ký </a> (Bật chế độ ẩn danh), truy cập trang web 1Win và tạo tài khoản mới.Nếu trang web không mở, hãy thử sử dụng VPN: VPNify, Planet VPN, HotSpot VPN, v.v.\n\n2. Đảm bảo nhập mã khuyến mãi Botavia khi đăng ký.\n\n3. Điền vào số dư của tài khoản của bạn.Tôi khuyên bạn nên bổ sung số dư từ 2000 rúp.\n\n4. Truy cập phần 1win trò chơi và chọn trò chơi.\n\n5. Sau đó nhấp vào \"Nhận tín hiệu.\"",
      "dep": "👑Trước khi bắt đầu, bạn cần nạp tiền vào tài khoản. Tôi khuyên bạn nên nạp ít nhất 2.000 rúp.",
      "support_text": "Nếu bạn có bất kỳ câu hỏi nào — hãy liên hệ hỗ trợ:\n👉 @maboy_poderzhka — chúng tôi sẽ hỗ trợ nhanh chóng và rõ ràng.",
      "instructions": "📘 Hướng dẫn sử dụng AI TRADING\n\nBot này được tạo để giúp bạn nhận các tín hiệu nhanh và chính xác khi giao dịch trên Pocket Option.\nBên dưới là hướng dẫn từng bước về cách thiết lập đúng và sử dụng các tính năng của bot."
    },
    "uk": {
      "welcome": "Ласкаво просимо! Будь ласка, оберіть мову:",
      "subscribe": "Для використання бота, будь ласка, підпишіться на наш канал:",
      "check": "✅ Перевірити підписку",
      "subscribe_btn": "📢 Підписатися на канал",
      "access_granted": "🎉 Доступ надано! Завантаження меню...",
      "not_subscribed": "❌ Ви не підписані! Натисніть 'Підписатися' і спробуйте знову.",
      "check_error": "⚠️ Помилка перевірки підписки. Будь ласка, спробуйте пізніше.",
      "menu": "Головне меню",
      "reg": "📝 Реєстрація",
      "instr": "📚 Інструкція",
      "support": "🛠 Підтримка",
      "algo": "⚙️ Алгоритм",
      "next": "➡️ Далі",
      "back": "⬅️ Назад",
      "registration_message": "привіт!Щоб активувати бота, проведіть швидку реєстрацію на веб -сайті 1Win (<a href = \"personal_link\"> натисніть </a>)\n\n⚠ Важливо створити новий обліковий запис за посиланням у цьому повідомленні!Відповідно до номера телефону, який раніше не використовувався на цьому сайті, а також без використання соціальних мереж.Якщо у вас вже є обліковий запис на 1win, <a href = \"personal_link\"> go </a>.\n\n1. Натисніть кнопку: <a href = \"personal_link\"> зареєструвати </a> (включення в режим інкогніто), перейдіть на веб -сайт 1win і створіть новий обліковий запис.Якщо сайт не відкривається, спробуйте використовувати VPN: VPNIFY, PLANET VPN, HOTSPOT VPN тощо!\n\n2. Обов’язково введіть промо -код Botavia під час реєстрації.\n\n3. Наповніть баланс свого рахунку.Я рекомендую поповнити баланс з 2000 рублів.\n\n4. Перейдіть до розділу 1 Win Games та виберіть гру.\n\n5. потім натисніть \"Отримати сигнал\".",
      "dep": "👑Перед стартом необхідно поповнити баланс свого акаунта. Рекомендую поповнювати від 2000 рублів.",
      "support_text": "Якщо у тебе виникли запитання — напиши в підтримку:\n👉 @maboy_poderzhka — допоможемо швидко і по суті.",
      "instructions": "📘 Інструкція з використання AI TRADING\n\nЦей бот створено, щоб допомогти тобі отримувати швидкі та точні сигнали для торгівлі на Pocket Option.\nНижче ти знайдеш покрокову інструкцію, як правильно налаштувати роботу і використовувати можливості бота."
    },
    "fr": {
      "welcome": "Bienvenue! Veuillez sélectionner votre langue:",
      "subscribe": "Pour utiliser le bot, veuillez vous abonner à notre chaîne:",
      "check": "✅ Vérifier l'abonnement",
      "subscribe_btn": "📢 S'abonner à la chaîne",
      "access_granted": "🎉 Accès accordé! Chargement du menu...",
      "not_subscribed": "❌ Vous n'êtes pas abonné! Cliquez sur 'S'abonner' et réessayez.",
      "check_error": "⚠️ Erreur de vérification d'abonnement. Veuillez réessayer plus tard.",
      "menu": "Menu Principal",
      "reg": "📝 Inscription",
      "instr": "📚 Instructions",
      "support": "🛠 Support",
      "algo": "⚙️ Algorithme",
      "next": "➡️ Suivant",
      "back": "⬅️ Retour",
      "registration_message": "👑 Bonjour!Pour activer le bot, prenez une inscription rapide sur le site Web 1Win (<a href = \"personnel_link\"> cliquez sur </a>)\n\n⚠️ Il est important de créer un nouveau compte par le lien dans ce message!Selon le numéro de téléphone qui était auparavant inutilisé sur ce site, ainsi que sans l'utilisation de réseaux sociaux.Si vous avez déjà un compte sur 1Win, <a href = \"personnel_link\"> allez </a>.\n\n1. Appuyez sur le bouton: <a href = \"Personal_link\"> Enregistrer </a> (Activer le mode incognito), accédez au site Web 1Win et créez un nouveau compte.Si le site ne s'ouvre pas, essayez d'utiliser VPN: VPNIFY, Planet VPN, Hotspot VPN et ainsi de suite!\n\n2. Assurez-vous de saisir le code promotionnel de Botavia lors de l'enregistrement.\n\n3. Remplissez le solde de votre compte.Je recommande de reconstituer l'équilibre de 2000 roubles.\n\n4. Allez à la section 1 avec les jeux et sélectionnez le jeu.\n\n5. Cliquez ensuite sur \"Obtenir un signal\".",
      "dep": "👑Avant de commencer, vous devez recharger le solde de votre compte. Je recommande de recharger avec au moins 2000 roubles.",
      "support_text": "Si vous avez des questions — contactez le support :\n👉 @maboy_poderzhka — nous vous aiderons rapidement et efficacement.",
      "instructions": "📘 Guide d'utilisation d'AI TRADING\n\nCe bot est conçu pour vous aider à obtenir des signaux rapides et précis pour trader sur Pocket Option.\nCi-dessous, vous trouverez un guide étape par étape pour effectuer la configuration correctement et utiliser les fonctionnalités du bot."
    }
  }
  